---------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/marcos.demetry/Dropbox/IFN/Per Hjertstrand/STATA//results_for_paper/output/logs/figure1_data_17 Feb 2020.lo
> g
  log type:  text
 opened on:  17 Feb 2020, 13:11:38
r; t=0.00 13:11:38

. 
. set rmsg on
r; t=0.00 13:11:38

. 
. ****************
. *** Programs ***
. ****************
. 
. capture program drop customSaveImage
r; t=0.00 13:11:38

. program customSaveImage
  1. 
.         local name `1'
  2.         
.         foreach extension in eps png pdf {
  3.                 graph export "${outputdir}/figures/`name'.`extension'", replace
  4.         }
  5.                 
. end
r; t=0.00 13:11:38

. 
. 
. ******************************
. *** Creating Figure 1 data ***
. ******************************
. 
. * Creating Excel-file for outputing results
. putexcel set "${outputdir}/tables/figure1_data.xlsx", sheet("checkaxiom") replace 
Note: file will be replaced when the first putexcel command is issued
r; t=0.00 13:11:38

. 
. * Column names matrix
. matrix resultsmatrix = J(366,4,.)
r; t=0.00 13:11:38

. matrix colname resultsmatrix = axiom efficiency number_pass share_pass
r; t=0.00 13:11:38

. 
. local axioms ewgarp ewarp egarp esarp eharp ecm
r; t=0.00 13:11:38

. 
. local axiomnumber = 1
r; t=0.00 13:11:38

. local rownumber = 1
r; t=0.00 13:11:38

. foreach axiom of local axioms {
  2. 
.                 *display "`axiom'"
.         forvalues eff = 700(5)995 {
  3. 
.                 local nr_pass = 0
  4.                 local share_pass = 0
  5.                 
.                 forvalues subject = 1(1)142 {
  6.                         *display "`subject'"
.                         
.                         checkax, price(P) quantity(Q`subject') axiom(`axiom') suppress efficiency(0.`eff')
  7.                         quietly return list
  8.                         
.                         local nr_pass = `nr_pass' + `r(PASS)'
  9.                         local share_pass = `nr_pass'/142
 10. 
.                 }
 11. 
.                 
.                 display "Axiom: `axiom'; Efficiency: 0.`eff'; Number Passed: `nr_pass'; Share Passed: `share_pass'"
 12.                 matrix resultsmatrix[`rownumber',1] = `axiomnumber'
 13.                 matrix resultsmatrix[`rownumber',2] = `eff'
 14.                 matrix resultsmatrix[`rownumber',3] = `nr_pass'
 15.                 matrix resultsmatrix[`rownumber',4] = `share_pass'
 16.                 
.                                 
.                 local rownumber = `rownumber' + 1
 17. 
.                 * Special case for efficiency == 1
.                 if `eff' == 995 {
 18.                         
.                         local nr_pass = 0
 19.                         local share_pass = 0
 20.                         
.                         forvalues subject = 1(1)142 {
 21.                                 *display "`subject'"
.                                 
.                                 checkax, price(P) quantity(Q`subject') axiom(`axiom') suppress efficiency(1)
 22.                                 quietly return list
 23.                                 
.                                 local nr_pass = `nr_pass' + `r(PASS)'
 24.                                 local share_pass = `nr_pass'/142
 25. 
.                         }
 26.                         
.                         display "Axiom: `axiom'; Efficiency: 1 ; Number Passed: `nr_pass'; Share Passed: `share_pass'"
 27.                         matrix resultsmatrix[`rownumber',1] = `axiomnumber'
 28.                         matrix resultsmatrix[`rownumber',2] = 1
 29.                         matrix resultsmatrix[`rownumber',3] = `nr_pass'
 30.                         matrix resultsmatrix[`rownumber',4] = `share_pass'
 31.                         
.                                         
.                         local rownumber = `rownumber' + 1
 32.                         
.                 }
 33. 
.         }
 34. 
.         local axiomnumber = `axiomnumber' + 1
 35. 
. }
Axiom: ewgarp; Efficiency: 0.700; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.705; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.710; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.715; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.720; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.725; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.730; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.735; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.740; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.745; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.750; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.755; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.760; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.765; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.770; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.775; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.780; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.785; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.790; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.795; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.800; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.805; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.810; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.815; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.820; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.825; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.830; Number Passed: 142; Share Passed: 1
Axiom: ewgarp; Efficiency: 0.835; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.840; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.845; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.850; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.855; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.860; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.865; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.870; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.875; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.880; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.885; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.890; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.895; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.900; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.905; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.910; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.915; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewgarp; Efficiency: 0.920; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.925; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.930; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.935; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.940; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.945; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.950; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.955; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.960; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.965; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.970; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.975; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewgarp; Efficiency: 0.980; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewgarp; Efficiency: 0.985; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewgarp; Efficiency: 0.990; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewgarp; Efficiency: 0.995; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewgarp; Efficiency: 1 ; Number Passed: 129; Share Passed: .9084507042253521
Axiom: ewarp; Efficiency: 0.700; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.705; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.710; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.715; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.720; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.725; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.730; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.735; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.740; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.745; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.750; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.755; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.760; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.765; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.770; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.775; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.780; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.785; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.790; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.795; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.800; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.805; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.810; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.815; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.820; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.825; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.830; Number Passed: 142; Share Passed: 1
Axiom: ewarp; Efficiency: 0.835; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.840; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.845; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.850; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.855; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.860; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.865; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.870; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.875; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.880; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.885; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.890; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.895; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.900; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.905; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.910; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.915; Number Passed: 141; Share Passed: .9929577464788732
Axiom: ewarp; Efficiency: 0.920; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.925; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.930; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.935; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.940; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.945; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.950; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.955; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.960; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.965; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.970; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ewarp; Efficiency: 0.975; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewarp; Efficiency: 0.980; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewarp; Efficiency: 0.985; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewarp; Efficiency: 0.990; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewarp; Efficiency: 0.995; Number Passed: 138; Share Passed: .971830985915493
Axiom: ewarp; Efficiency: 1 ; Number Passed: 129; Share Passed: .9084507042253521
Axiom: egarp; Efficiency: 0.700; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.705; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.710; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.715; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.720; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.725; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.730; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.735; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.740; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.745; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.750; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.755; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.760; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.765; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.770; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.775; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.780; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.785; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.790; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.795; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.800; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.805; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.810; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.815; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.820; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.825; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.830; Number Passed: 142; Share Passed: 1
Axiom: egarp; Efficiency: 0.835; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.840; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.845; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.850; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.855; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.860; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.865; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.870; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.875; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.880; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.885; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.890; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.895; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.900; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.905; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.910; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.915; Number Passed: 141; Share Passed: .9929577464788732
Axiom: egarp; Efficiency: 0.920; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.925; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.930; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.935; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.940; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.945; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.950; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.955; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.960; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.965; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.970; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.975; Number Passed: 139; Share Passed: .9788732394366197
Axiom: egarp; Efficiency: 0.980; Number Passed: 138; Share Passed: .971830985915493
Axiom: egarp; Efficiency: 0.985; Number Passed: 138; Share Passed: .971830985915493
Axiom: egarp; Efficiency: 0.990; Number Passed: 138; Share Passed: .971830985915493
Axiom: egarp; Efficiency: 0.995; Number Passed: 138; Share Passed: .971830985915493
Axiom: egarp; Efficiency: 1 ; Number Passed: 129; Share Passed: .9084507042253521
Axiom: esarp; Efficiency: 0.700; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.705; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.710; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.715; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.720; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.725; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.730; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.735; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.740; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.745; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.750; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.755; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.760; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.765; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.770; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.775; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.780; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.785; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.790; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.795; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.800; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.805; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.810; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.815; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.820; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.825; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.830; Number Passed: 142; Share Passed: 1
Axiom: esarp; Efficiency: 0.835; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.840; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.845; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.850; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.855; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.860; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.865; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.870; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.875; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.880; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.885; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.890; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.895; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.900; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.905; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.910; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.915; Number Passed: 141; Share Passed: .9929577464788732
Axiom: esarp; Efficiency: 0.920; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.925; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.930; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.935; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.940; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.945; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.950; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.955; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.960; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.965; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.970; Number Passed: 139; Share Passed: .9788732394366197
Axiom: esarp; Efficiency: 0.975; Number Passed: 138; Share Passed: .971830985915493
Axiom: esarp; Efficiency: 0.980; Number Passed: 138; Share Passed: .971830985915493
Axiom: esarp; Efficiency: 0.985; Number Passed: 138; Share Passed: .971830985915493
Axiom: esarp; Efficiency: 0.990; Number Passed: 138; Share Passed: .971830985915493
Axiom: esarp; Efficiency: 0.995; Number Passed: 138; Share Passed: .971830985915493
Axiom: esarp; Efficiency: 1 ; Number Passed: 129; Share Passed: .9084507042253521
Axiom: eharp; Efficiency: 0.700; Number Passed: 142; Share Passed: 1
Axiom: eharp; Efficiency: 0.705; Number Passed: 142; Share Passed: 1
Axiom: eharp; Efficiency: 0.710; Number Passed: 141; Share Passed: .9929577464788732
Axiom: eharp; Efficiency: 0.715; Number Passed: 141; Share Passed: .9929577464788732
Axiom: eharp; Efficiency: 0.720; Number Passed: 141; Share Passed: .9929577464788732
Axiom: eharp; Efficiency: 0.725; Number Passed: 141; Share Passed: .9929577464788732
Axiom: eharp; Efficiency: 0.730; Number Passed: 141; Share Passed: .9929577464788732
Axiom: eharp; Efficiency: 0.735; Number Passed: 141; Share Passed: .9929577464788732
Axiom: eharp; Efficiency: 0.740; Number Passed: 141; Share Passed: .9929577464788732
Axiom: eharp; Efficiency: 0.745; Number Passed: 141; Share Passed: .9929577464788732
Axiom: eharp; Efficiency: 0.750; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.755; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.760; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.765; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.770; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.775; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.780; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.785; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.790; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.795; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.800; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.805; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.810; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.815; Number Passed: 140; Share Passed: .9859154929577465
Axiom: eharp; Efficiency: 0.820; Number Passed: 139; Share Passed: .9788732394366197
Axiom: eharp; Efficiency: 0.825; Number Passed: 139; Share Passed: .9788732394366197
Axiom: eharp; Efficiency: 0.830; Number Passed: 138; Share Passed: .971830985915493
Axiom: eharp; Efficiency: 0.835; Number Passed: 138; Share Passed: .971830985915493
Axiom: eharp; Efficiency: 0.840; Number Passed: 137; Share Passed: .9647887323943662
Axiom: eharp; Efficiency: 0.845; Number Passed: 137; Share Passed: .9647887323943662
Axiom: eharp; Efficiency: 0.850; Number Passed: 136; Share Passed: .9577464788732394
Axiom: eharp; Efficiency: 0.855; Number Passed: 135; Share Passed: .9507042253521126
Axiom: eharp; Efficiency: 0.860; Number Passed: 135; Share Passed: .9507042253521126
Axiom: eharp; Efficiency: 0.865; Number Passed: 135; Share Passed: .9507042253521126
Axiom: eharp; Efficiency: 0.870; Number Passed: 134; Share Passed: .9436619718309859
Axiom: eharp; Efficiency: 0.875; Number Passed: 134; Share Passed: .9436619718309859
Axiom: eharp; Efficiency: 0.880; Number Passed: 134; Share Passed: .9436619718309859
Axiom: eharp; Efficiency: 0.885; Number Passed: 133; Share Passed: .9366197183098591
Axiom: eharp; Efficiency: 0.890; Number Passed: 133; Share Passed: .9366197183098591
Axiom: eharp; Efficiency: 0.895; Number Passed: 133; Share Passed: .9366197183098591
Axiom: eharp; Efficiency: 0.900; Number Passed: 133; Share Passed: .9366197183098591
Axiom: eharp; Efficiency: 0.905; Number Passed: 131; Share Passed: .9225352112676056
Axiom: eharp; Efficiency: 0.910; Number Passed: 130; Share Passed: .9154929577464789
Axiom: eharp; Efficiency: 0.915; Number Passed: 127; Share Passed: .8943661971830986
Axiom: eharp; Efficiency: 0.920; Number Passed: 127; Share Passed: .8943661971830986
Axiom: eharp; Efficiency: 0.925; Number Passed: 127; Share Passed: .8943661971830986
Axiom: eharp; Efficiency: 0.930; Number Passed: 127; Share Passed: .8943661971830986
Axiom: eharp; Efficiency: 0.935; Number Passed: 126; Share Passed: .8873239436619719
Axiom: eharp; Efficiency: 0.940; Number Passed: 123; Share Passed: .8661971830985915
Axiom: eharp; Efficiency: 0.945; Number Passed: 118; Share Passed: .8309859154929577
Axiom: eharp; Efficiency: 0.950; Number Passed: 118; Share Passed: .8309859154929577
Axiom: eharp; Efficiency: 0.955; Number Passed: 117; Share Passed: .823943661971831
Axiom: eharp; Efficiency: 0.960; Number Passed: 110; Share Passed: .7746478873239436
Axiom: eharp; Efficiency: 0.965; Number Passed: 109; Share Passed: .7676056338028169
Axiom: eharp; Efficiency: 0.970; Number Passed: 105; Share Passed: .7394366197183099
Axiom: eharp; Efficiency: 0.975; Number Passed: 104; Share Passed: .7323943661971831
Axiom: eharp; Efficiency: 0.980; Number Passed: 102; Share Passed: .7183098591549296
Axiom: eharp; Efficiency: 0.985; Number Passed: 102; Share Passed: .7183098591549296
Axiom: eharp; Efficiency: 0.990; Number Passed: 96; Share Passed: .676056338028169
Axiom: eharp; Efficiency: 0.995; Number Passed: 95; Share Passed: .6690140845070423
Axiom: eharp; Efficiency: 1 ; Number Passed: 14; Share Passed: .0985915492957746
Axiom: ecm; Efficiency: 0.700; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.705; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.710; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.715; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.720; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.725; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.730; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.735; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.740; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.745; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.750; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.755; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.760; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.765; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.770; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.775; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.780; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.785; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.790; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.795; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.800; Number Passed: 142; Share Passed: 1
Axiom: ecm; Efficiency: 0.805; Number Passed: 140; Share Passed: .9859154929577465
Axiom: ecm; Efficiency: 0.810; Number Passed: 140; Share Passed: .9859154929577465
Axiom: ecm; Efficiency: 0.815; Number Passed: 140; Share Passed: .9859154929577465
Axiom: ecm; Efficiency: 0.820; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ecm; Efficiency: 0.825; Number Passed: 139; Share Passed: .9788732394366197
Axiom: ecm; Efficiency: 0.830; Number Passed: 138; Share Passed: .971830985915493
Axiom: ecm; Efficiency: 0.835; Number Passed: 138; Share Passed: .971830985915493
Axiom: ecm; Efficiency: 0.840; Number Passed: 138; Share Passed: .971830985915493
Axiom: ecm; Efficiency: 0.845; Number Passed: 137; Share Passed: .9647887323943662
Axiom: ecm; Efficiency: 0.850; Number Passed: 137; Share Passed: .9647887323943662
Axiom: ecm; Efficiency: 0.855; Number Passed: 137; Share Passed: .9647887323943662
Axiom: ecm; Efficiency: 0.860; Number Passed: 137; Share Passed: .9647887323943662
Axiom: ecm; Efficiency: 0.865; Number Passed: 137; Share Passed: .9647887323943662
Axiom: ecm; Efficiency: 0.870; Number Passed: 136; Share Passed: .9577464788732394
Axiom: ecm; Efficiency: 0.875; Number Passed: 136; Share Passed: .9577464788732394
Axiom: ecm; Efficiency: 0.880; Number Passed: 136; Share Passed: .9577464788732394
Axiom: ecm; Efficiency: 0.885; Number Passed: 133; Share Passed: .9366197183098591
Axiom: ecm; Efficiency: 0.890; Number Passed: 132; Share Passed: .9295774647887324
Axiom: ecm; Efficiency: 0.895; Number Passed: 131; Share Passed: .9225352112676056
Axiom: ecm; Efficiency: 0.900; Number Passed: 129; Share Passed: .9084507042253521
Axiom: ecm; Efficiency: 0.905; Number Passed: 99; Share Passed: .6971830985915493
Axiom: ecm; Efficiency: 0.910; Number Passed: 98; Share Passed: .6901408450704225
Axiom: ecm; Efficiency: 0.915; Number Passed: 97; Share Passed: .6830985915492958
Axiom: ecm; Efficiency: 0.920; Number Passed: 95; Share Passed: .6690140845070423
Axiom: ecm; Efficiency: 0.925; Number Passed: 94; Share Passed: .6619718309859155
Axiom: ecm; Efficiency: 0.930; Number Passed: 91; Share Passed: .6408450704225352
Axiom: ecm; Efficiency: 0.935; Number Passed: 89; Share Passed: .6267605633802817
Axiom: ecm; Efficiency: 0.940; Number Passed: 87; Share Passed: .6126760563380281
Axiom: ecm; Efficiency: 0.945; Number Passed: 84; Share Passed: .5915492957746479
Axiom: ecm; Efficiency: 0.950; Number Passed: 82; Share Passed: .5774647887323944
Axiom: ecm; Efficiency: 0.955; Number Passed: 76; Share Passed: .5352112676056338
Axiom: ecm; Efficiency: 0.960; Number Passed: 13; Share Passed: .0915492957746479
Axiom: ecm; Efficiency: 0.965; Number Passed: 9; Share Passed: .0633802816901408
Axiom: ecm; Efficiency: 0.970; Number Passed: 9; Share Passed: .0633802816901408
Axiom: ecm; Efficiency: 0.975; Number Passed: 5; Share Passed: .0352112676056338
Axiom: ecm; Efficiency: 0.980; Number Passed: 5; Share Passed: .0352112676056338
Axiom: ecm; Efficiency: 0.985; Number Passed: 3; Share Passed: .0211267605633803
Axiom: ecm; Efficiency: 0.990; Number Passed: 1; Share Passed: .0070422535211268
Axiom: ecm; Efficiency: 0.995; Number Passed: 1; Share Passed: .0070422535211268
Axiom: ecm; Efficiency: 1 ; Number Passed: 1; Share Passed: .0070422535211268
r; t=44.52 13:12:22

. 
. putexcel A1 = matrix(resultsmatrix), colnames
file C:/Users/marcos.demetry/Dropbox/IFN/Per Hjertstrand/STATA//results_for_paper/output/tables/figure1_data.xlsx saved
r; t=0.02 13:12:22

. 
. ****************
. *** Figure 1 ***
. ****************
. 
. import excel "${outputdir}/tables/figure1_data.xlsx", clear firstrow
(4 vars, 366 obs)
r; t=0.01 13:12:22

. 
. label define axiomLabels 1 "eWGARP" 2 "eWARP" 3 "eGARP" 4 "eSARP" 5 "eHARP" 6 "eCM"
r; t=0.00 13:12:22

. label value axiom axiomLabels
r; t=0.00 13:12:22

. 
. decode axiom, gen(axiom_str)
r; t=0.00 13:12:22

. drop axiom
r; t=0.00 13:12:22

. rename axiom_str axiom
r; t=0.00 13:12:22

. 
. rename share_pass share_pass_
r; t=0.00 13:12:22

. 
. replace efficiency = 1000 if efficiency == 1
(6 real changes made)
r; t=0.00 13:12:22

. replace efficiency = efficiency/1000
variable efficiency was int now float
(366 real changes made)
r; t=0.00 13:12:22

. 
. reshape wide number_pass share_pass_, i(efficiency) j(axiom) string
(note: j = eCM eGARP eHARP eSARP eWARP eWGARP)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      366   ->      61
Number of variables                   4   ->      13
j variable (6 values)             axiom   ->   (dropped)
xij variables:
                            number_pass   ->   number_passeCM number_passeGARP ... number_passeWGARP
                            share_pass_   ->   share_pass_eCM share_pass_eGARP ... share_pass_eWGARP
-----------------------------------------------------------------------------
r; t=0.12 13:12:22

. 
. * Stata journal scheme (manual colors) with legend
. twoway  (line share_pass_eHARP e, lcolor(edkblue))      ///
>                 (line share_pass_eCM e, lcolor(orange_red))     ///
>                 (line share_pass_eGARP e, lcolor(gray)) ///
>                 (line share_pass_eWGARP e, lcolor(sand))        ///
>                 (line share_pass_eSARP e, lcolor(blue)) ///
>                 (line share_pass_eWARP e, lcolor(forest_green)  ///
>                 ytitle("Fraction of subjects") xtitle("Efficiency (e)") ///
>                 ylabel(0(0.1)1, format(%3.1f) angle(horisontal)) ///
>                 xlabel(0.7(0.01)1, format(%3.2f) angle(vertical)) ///
>                 legend(order(1 "eHARP" 2 "eCM" 3 "eGARP" 4 "eWGARP" 5 "eSARP" 6 "eWARP") rows(2)) ///
>                 scheme(sj))
(note:  named style horisontal not found in class anglestyle, default attributes used)
r; t=3.78 13:12:26

. 
. customSaveImage fig1
(file C:/Users/marcos.demetry/Dropbox/IFN/Per Hjertstrand/STATA//results_for_paper/output/figures/fig1.eps written in EPS format)
(file C:/Users/marcos.demetry/Dropbox/IFN/Per Hjertstrand/STATA//results_for_paper/output/figures/fig1.png written in PNG format)
(file C:/Users/marcos.demetry/Dropbox/IFN/Per Hjertstrand/STATA//results_for_paper/output/figures/fig1.pdf written in PDF format)
r; t=0.26 13:12:26

. 
. 
. log close
      name:  <unnamed>
       log:  C:/Users/marcos.demetry/Dropbox/IFN/Per Hjertstrand/STATA//results_for_paper/output/logs/figure1_data_17 Feb 2020.lo
> g
  log type:  text
 closed on:  17 Feb 2020, 13:12:26
---------------------------------------------------------------------------------------------------------------------------------
