------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/marcos.demetry/Dropbox/IFN/Per Hjertstrand/STATA//results_for_paper/output/logs/powerps_speed_results.log
  log type:  text
 opened on:  17 Feb 2020, 10:50:27
r; t=0.00 10:50:27

. 
. * Importing Andreoni and Miller (2001) data
. do "${codedir}/importing_andreoni_data.do"

. ** Importing andreoni data **
. 
. clear all
r; t=0.01 10:50:27

. 
. import delimited using "${datadir}/qHOLD_E1.txt", clear delim(" ")
(8 vars, 142 obs)
r; t=0.04 10:50:27

. 
. mkmat v1 v2 v3 v4 v5 v6 v7 v8, matrix(qHOLD)
r; t=0.00 10:50:27

. 
. import delimited using "${datadir}/qPASS_E1.txt", clear delim(" ")
(8 vars, 142 obs)
r; t=0.01 10:50:27

. 
. mkmat v1 v2 v3 v4 v5 v6 v7 v8, matrix(qPASS)
r; t=0.00 10:50:27

. 
. gen v9 = _n
r; t=0.00 10:50:27

. 
. mkmat v9, matrix(SUB_NUM)
r; t=0.00 10:50:27

. 
. mata:
------------------------------------------------- mata (type end to exit) ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
:         
:         //Loading data to mata
:         qHOLD = st_matrix("qHOLD")

:         qPASS = st_matrix("qPASS")

:         
:         //Number of time periods
:         T = cols(qHOLD)

: 
:         //Empty price matrix
:         P = J(T, 2, .)

:         
:         //Filling in price matrix...
:                 // for the first good
:         P[1,1] = 1/3

:         P[2,1] = 1

:         P[3,1] = 1/2

:         P[4,1] = 1

:         P[5,1] = 1/2

:         P[6,1] = 1

:         P[7,1] = 1

:         P[8,1] = 1

:                 // for the second good
:         P[1,2] = 1

:         P[2,2] = 1/3

:         P[3,2] = 1

:         P[4,2] = 1/2

:         P[5,2] = 1

:         P[6,2] = 1/2

:         P[7,2] = 1

:         P[8,2] = 1

:                 //Exporting price matrix
:         st_matrix("P", P)

: 
:         //Setting expenditure
:         TE = J(T, 1, .)

:         
:         TE[1] = 40

:         TE[2] = 40

:         TE[3] = 60

:         TE[4] = 60

:         TE[5] = 75

:         TE[6] = 75

:         TE[7] = 60

:         TE[8] = 100

:                 //Exporting TE matrix
:         st_matrix("TE", TE)

:         
:         //Subjects
:         SUB = rows(qHOLD)

:         SUB_NUM = st_matrix("SUB_NUM")

: 
:         disptext = "Subject: "

:         Q = J(T,2,.)

:         
:         for (sub = 1; sub<=SUB; sub++) {
>                 display(disptext)
>                 sub
>                 
>                 //Creating quantity matrix per subject
>                 Q`sub'[.,1] = qHOLD[sub,.]'
>                 Q`sub'[.,2] = qPASS[sub,.]'
>                 Q`sub'
>                 
>                 //Exporting matrices to Stata
>                 st_matrix("Q"+strofreal(sub), Q`sub')
> 
>         }
Subject: 
  1
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |   80    20  |
  4 |   20    80  |
  5 |  100    25  |
  6 |   25   100  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  2
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  3
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |   80    20  |
  4 |   40    40  |
  5 |  120    15  |
  6 |   60    30  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  4
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |  120     0  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  5
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  6
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |    0   150  |
  7 |   30    30  |
  8 |  100     0  |
    +-------------+
Subject: 
  7
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |    0   150  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  8
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  9
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  10
         1     2
    +-------------+
  1 |   90    10  |
  2 |   15    75  |
  3 |   80    20  |
  4 |   25    70  |
  5 |  100    25  |
  6 |   35    80  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  11
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  12
         1     2
    +-------------+
  1 |   30    30  |
  2 |   30    30  |
  3 |   80    20  |
  4 |   40    40  |
  5 |  120    15  |
  6 |   50    50  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  13
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  14
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  15
         1     2
    +-------------+
  1 |   60    20  |
  2 |   30    30  |
  3 |   80    20  |
  4 |   10   100  |
  5 |   50    50  |
  6 |   50    50  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  16
         1     2
    +-------------+
  1 |  120     0  |
  2 |   20    60  |
  3 |  100    10  |
  4 |   30    60  |
  5 |  130    10  |
  6 |   35    80  |
  7 |   30    30  |
  8 |  100     0  |
    +-------------+
Subject: 
  17
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  18
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  19
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  20
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |   60    30  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   55    40  |
  7 |   30    30  |
  8 |   60    40  |
    +-------------+
Subject: 
  21
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  22
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   55    10  |
  5 |  150     0  |
  6 |   70    10  |
  7 |   50    10  |
  8 |   90    10  |
    +-------------+
Subject: 
  23
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |    0   150  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  24
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |  120     0  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  25
        1    2
    +-----------+
  1 |  90   10  |
  2 |  20   60  |
  3 |  90   15  |
  4 |  20   80  |
  5 |  90   30  |
  6 |  30   90  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  26
         1     2
    +-------------+
  1 |   90    10  |
  2 |   10    90  |
  3 |   90    15  |
  4 |   25    70  |
  5 |  110    20  |
  6 |   50    50  |
  7 |   15    45  |
  8 |   65    35  |
    +-------------+
Subject: 
  27
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  28
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  29
         1     2
    +-------------+
  1 |  120     0  |
  2 |   20    60  |
  3 |  120     0  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  30
        1    2
    +-----------+
  1 |  66   18  |
  2 |  30   30  |
  3 |  60   30  |
  4 |  50   20  |
  5 |  80   35  |
  6 |  50   50  |
  7 |  40   20  |
  8 |  60   40  |
    +-----------+
Subject: 
  31
        1    2
    +-----------+
  1 |  45   25  |
  2 |  30   30  |
  3 |  60   30  |
  4 |  40   40  |
  5 |  60   45  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  60   40  |
    +-----------+
Subject: 
  32
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  33
         1     2
    +-------------+
  1 |  105     5  |
  2 |   20    60  |
  3 |   90    15  |
  4 |   25    70  |
  5 |  100    25  |
  6 |   50    50  |
  7 |   30    30  |
  8 |   70    30  |
    +-------------+
Subject: 
  34
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  35
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  36
         1     2
    +-------------+
  1 |   90    10  |
  2 |   30    30  |
  3 |   40    40  |
  4 |   20    80  |
  5 |  110    20  |
  6 |   25   100  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  37
         1     2
    +-------------+
  1 |  120     0  |
  2 |   10    90  |
  3 |  120     0  |
  4 |   20    80  |
  5 |  150     0  |
  6 |   25   100  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  38
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  20   50  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  39
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  40
         1     2
    +-------------+
  1 |   30    30  |
  2 |    0   120  |
  3 |   40    40  |
  4 |   40    40  |
  5 |   30    60  |
  6 |    0   150  |
  7 |   60     0  |
  8 |    0   100  |
    +-------------+
Subject: 
  41
         1     2
    +-------------+
  1 |   90    10  |
  2 |   10    90  |
  3 |  120     0  |
  4 |   20    80  |
  5 |  100    25  |
  6 |   25   100  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  42
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  43
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  44
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |   40    40  |
  4 |   40    40  |
  5 |  100    25  |
  6 |   50    50  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  45
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |  114     3  |
  4 |   50    20  |
  5 |  140     5  |
  6 |   65    20  |
  7 |   55     5  |
  8 |   90    10  |
    +-------------+
Subject: 
  46
         1     2
    +-------------+
  1 |   60    20  |
  2 |   30    30  |
  3 |   70    25  |
  4 |   40    40  |
  5 |  100    25  |
  6 |   50    50  |
  7 |   50    10  |
  8 |   70    30  |
    +-------------+
Subject: 
  47
         1     2
    +-------------+
  1 |  105     5  |
  2 |   30    30  |
  3 |  120     0  |
  4 |   50    20  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   30    30  |
  8 |  100     0  |
    +-------------+
Subject: 
  48
         1     2
    +-------------+
  1 |   60    20  |
  2 |   30    30  |
  3 |   60    30  |
  4 |   40    40  |
  5 |  100    25  |
  6 |   50    50  |
  7 |   50    10  |
  8 |   60    40  |
    +-------------+
Subject: 
  49
         1     2
    +-------------+
  1 |  114     2  |
  2 |   40     0  |
  3 |  110     5  |
  4 |   58     4  |
  5 |  140     5  |
  6 |   74     2  |
  7 |   55     5  |
  8 |  100     0  |
    +-------------+
Subject: 
  50
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  51
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  52
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  53
         1     2
    +-------------+
  1 |  105     5  |
  2 |   35    15  |
  3 |  100    10  |
  4 |   50    20  |
  5 |  140     5  |
  6 |   63    24  |
  7 |   50    10  |
  8 |   75    25  |
    +-------------+
Subject: 
  54
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |    0   150  |
  7 |    0    60  |
  8 |    0   100  |
    +-------------+
Subject: 
  55
         1     2
    +-------------+
  1 |  120     0  |
  2 |   12    84  |
  3 |  120     0  |
  4 |   25    70  |
  5 |  150     0  |
  6 |   30    90  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  56
         1     2
    +-------------+
  1 |  120     0  |
  2 |   10    90  |
  3 |  120     0  |
  4 |   10   100  |
  5 |  150     0  |
  6 |   15   120  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  57
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  58
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  59
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |   86    17  |
  4 |   23    74  |
  5 |  150     0  |
  6 |   35    80  |
  7 |   47    13  |
  8 |   40    60  |
    +-------------+
Subject: 
  60
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  61
        1    2
    +-----------+
  1 |  90   10  |
  2 |  40    0  |
  3 |  60   30  |
  4 |  48   24  |
  5 |  70   40  |
  6 |  55   40  |
  7 |  40   20  |
  8 |  90   10  |
    +-----------+
Subject: 
  62
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |    0   150  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  63
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  64
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |  110     5  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   60     0  |
  8 |   70    30  |
    +-------------+
Subject: 
  65
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  66
         1     2
    +-------------+
  1 |  120     0  |
  2 |   20    60  |
  3 |  120     0  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  67
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  68
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  69
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  70
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  71
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |   25   100  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  72
        1    2
    +-----------+
  1 |  33   29  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  41   38  |
  5 |  52   49  |
  6 |  50   50  |
  7 |  31   29  |
  8 |  50   50  |
    +-----------+
Subject: 
  73
         1     2
    +-------------+
  1 |   60    20  |
  2 |   20    60  |
  3 |   80    20  |
  4 |   40    40  |
  5 |  120    15  |
  6 |   50    50  |
  7 |   20    40  |
  8 |   75    25  |
    +-------------+
Subject: 
  74
         1     2
    +-------------+
  1 |   60    20  |
  2 |   30    30  |
  3 |   80    20  |
  4 |   45    30  |
  5 |  100    25  |
  6 |   55    40  |
  7 |   40    20  |
  8 |   75    25  |
    +-------------+
Subject: 
  75
        1    2
    +-----------+
  1 |  60   20  |
  2 |  30   30  |
  3 |  80   20  |
  4 |  45   30  |
  5 |  70   40  |
  6 |  60   30  |
  7 |  40   20  |
  8 |  60   40  |
    +-----------+
Subject: 
  76
         1     2
    +-------------+
  1 |  114     2  |
  2 |   39     3  |
  3 |  116     2  |
  4 |   59     2  |
  5 |  148     1  |
  6 |   73     4  |
  7 |   59     1  |
  8 |   98     2  |
    +-------------+
Subject: 
  77
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |   40    40  |
  4 |   40    40  |
  5 |   50    50  |
  6 |   50    50  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  78
         1     2
    +-------------+
  1 |  120     0  |
  2 |   35    15  |
  3 |  120     0  |
  4 |   50    20  |
  5 |   90    30  |
  6 |   75     0  |
  7 |   50    10  |
  8 |  100     0  |
    +-------------+
Subject: 
  79
         1     2
    +-------------+
  1 |   90    10  |
  2 |   30    30  |
  3 |  100    10  |
  4 |   45    30  |
  5 |  110    20  |
  6 |   50    50  |
  7 |   40    20  |
  8 |   60    40  |
    +-------------+
Subject: 
  80
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  81
         1     2
    +-------------+
  1 |  120     0  |
  2 |   10    90  |
  3 |  120     0  |
  4 |   50    20  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  82
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  83
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |  120     0  |
  4 |   50    20  |
  5 |  150     0  |
  6 |   60    30  |
  7 |   50    10  |
  8 |   80    20  |
    +-------------+
Subject: 
  84
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  85
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  86
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |    0   150  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  87
         1     2
    +-------------+
  1 |   60    20  |
  2 |   30    30  |
  3 |   80    20  |
  4 |   40    40  |
  5 |  120    15  |
  6 |   55    40  |
  7 |   40    20  |
  8 |   50    50  |
    +-------------+
Subject: 
  88
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  89
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  90
        1    2
    +-----------+
  1 |  33   29  |
  2 |  31   27  |
  3 |  38   41  |
  4 |  41   38  |
  5 |  52   49  |
  6 |  49   52  |
  7 |  31   29  |
  8 |  51   49  |
    +-----------+
Subject: 
  91
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  92
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  108     6  |
  4 |   58     4  |
  5 |  146     2  |
  6 |   70    10  |
  7 |   55     5  |
  8 |   87    13  |
    +-------------+
Subject: 
  93
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  94
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   60    30  |
  7 |   60     0  |
  8 |   75    25  |
    +-------------+
Subject: 
  95
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  96
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |    0   150  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  97
         1     2
    +-------------+
  1 |  105     5  |
  2 |   30    30  |
  3 |  100    10  |
  4 |   40    40  |
  5 |  100    25  |
  6 |   55    40  |
  7 |   50    10  |
  8 |   90    10  |
    +-------------+
Subject: 
  98
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  99
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |  100    10  |
  4 |   35    50  |
  5 |   90    30  |
  6 |   50    50  |
  7 |   50    10  |
  8 |   50    50  |
    +-------------+
Subject: 
  100
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   50    20  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   55     5  |
  8 |  100     0  |
    +-------------+
Subject: 
  101
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  102
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  103
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  104
        1    2
    +-----------+
  1 |  60   20  |
  2 |  30   30  |
  3 |  80   20  |
  4 |  30   60  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  70   30  |
    +-----------+
Subject: 
  105
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  106
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  107
         1     2
    +-------------+
  1 |  120     0  |
  2 |   10    90  |
  3 |  120     0  |
  4 |   20    80  |
  5 |  150     0  |
  6 |   25   100  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  108
         1     2
    +-------------+
  1 |   75    15  |
  2 |   15    75  |
  3 |   80    20  |
  4 |   20    80  |
  5 |  100    25  |
  6 |   25   100  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  109
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  110
         1     2
    +-------------+
  1 |  117     1  |
  2 |   30    30  |
  3 |  100    10  |
  4 |   55    10  |
  5 |  130    10  |
  6 |   70    10  |
  7 |   45    15  |
  8 |   75    25  |
    +-------------+
Subject: 
  111
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  112
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  113
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  114
         1     2
    +-------------+
  1 |   90    10  |
  2 |   30    30  |
  3 |   80    20  |
  4 |   40    40  |
  5 |  100    25  |
  6 |   50    50  |
  7 |   30    30  |
  8 |   75    25  |
    +-------------+
Subject: 
  115
         1     2
    +-------------+
  1 |  120     0  |
  2 |   35    15  |
  3 |  100    10  |
  4 |   55    10  |
  5 |  150     0  |
  6 |   70    10  |
  7 |   55     5  |
  8 |   90    10  |
    +-------------+
Subject: 
  116
         1     2
    +-------------+
  1 |  105     5  |
  2 |   39     3  |
  3 |  110     5  |
  4 |   45    30  |
  5 |  100    25  |
  6 |   58    34  |
  7 |   45    15  |
  8 |   95     5  |
    +-------------+
Subject: 
  117
         1     2
    +-------------+
  1 |   75    15  |
  2 |   30    30  |
  3 |   80    20  |
  4 |   40    40  |
  5 |  100    25  |
  6 |   55    40  |
  7 |   40    20  |
  8 |   70    30  |
    +-------------+
Subject: 
  118
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  119
         1     2
    +-------------+
  1 |   90    10  |
  2 |   30    30  |
  3 |   80    20  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  120
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  121
         1     2
    +-------------+
  1 |  105     5  |
  2 |    5   105  |
  3 |  100    10  |
  4 |   10   100  |
  5 |  120    15  |
  6 |   10   130  |
  7 |   40    20  |
  8 |   60    40  |
    +-------------+
Subject: 
  122
         1     2
    +-------------+
  1 |  120     0  |
  2 |   10    90  |
  3 |  120     0  |
  4 |   20    80  |
  5 |  150     0  |
  6 |   25   100  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  123
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  124
         1     2
    +-------------+
  1 |  120     0  |
  2 |   30    30  |
  3 |  120     0  |
  4 |   40    40  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  125
        1    2
    +-----------+
  1 |  30   30  |
  2 |  30   30  |
  3 |  40   40  |
  4 |  40   40  |
  5 |  50   50  |
  6 |  50   50  |
  7 |  30   30  |
  8 |  50   50  |
    +-----------+
Subject: 
  126
         1     2
    +-------------+
  1 |  105     5  |
  2 |   30    30  |
  3 |   80    20  |
  4 |   50    20  |
  5 |  100    25  |
  6 |   60    30  |
  7 |   40    20  |
  8 |   50    50  |
    +-------------+
Subject: 
  127
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  128
        1    2
    +-----------+
  1 |  60   20  |
  2 |  30   30  |
  3 |  90   15  |
  4 |  45   30  |
  5 |  80   35  |
  6 |  55   40  |
  7 |  31   29  |
  8 |  51   49  |
    +-----------+
Subject: 
  129
         1     2
    +-------------+
  1 |  105     5  |
  2 |    0   120  |
  3 |   80    20  |
  4 |   15    90  |
  5 |  150     0  |
  6 |   25   100  |
  7 |   60     0  |
  8 |   50    50  |
    +-------------+
Subject: 
  130
         1     2
    +-------------+
  1 |  117     1  |
  2 |   30    30  |
  3 |  118     1  |
  4 |   45    30  |
  5 |  140     5  |
  6 |   45    60  |
  7 |   50    10  |
  8 |   90    10  |
    +-------------+
Subject: 
  131
        1    2
    +-----------+
  1 |  90   10  |
  2 |  35   15  |
  3 |  80   20  |
  4 |  50   20  |
  5 |  80   35  |
  6 |  70   10  |
  7 |  40   20  |
  8 |  75   25  |
    +-----------+
Subject: 
  132
         1     2
    +-------------+
  1 |  120     0  |
  2 |    0   120  |
  3 |  120     0  |
  4 |    0   120  |
  5 |  150     0  |
  6 |    0   150  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  133
         1     2
    +-------------+
  1 |  120     0  |
  2 |   10    90  |
  3 |  120     0  |
  4 |   30    60  |
  5 |  150     0  |
  6 |   45    60  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  134
         1     2
    +-------------+
  1 |  120     0  |
  2 |   35    15  |
  3 |  100    10  |
  4 |   50    20  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   50    10  |
  8 |  100     0  |
    +-------------+
Subject: 
  135
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |  120     0  |
  4 |   60     0  |
  5 |  150     0  |
  6 |   75     0  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  136
         1     2
    +-------------+
  1 |  120     0  |
  2 |   20    60  |
  3 |  120     0  |
  4 |   20    80  |
  5 |  150     0  |
  6 |   50    50  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+
Subject: 
  137
         1     2
    +-------------+
  1 |   84    12  |
  2 |   15    75  |
  3 |   30    45  |
  4 |    6   108  |
  5 |   94    28  |
  6 |   22   106  |
  7 |   50    10  |
  8 |   80    20  |
    +-------------+
Subject: 
  138
         1     2
    +-------------+
  1 |  120     0  |
  2 |   39     3  |
  3 |  110     5  |
  4 |   40    40  |
  5 |  140     5  |
  6 |   70    10  |
  7 |   50    10  |
  8 |   80    20  |
    +-------------+
Subject: 
  139
         1     2
    +-------------+
  1 |  120     0  |
  2 |   40     0  |
  3 |   80    20  |
  4 |   40    40  |
  5 |  120    15  |
  6 |   55    40  |
  7 |   30    30  |
  8 |   75    25  |
    +-------------+
Subject: 
  140
         1     2
    +-------------+
  1 |   90    10  |
  2 |   10    90  |
  3 |   80    20  |
  4 |   20    80  |
  5 |  100    25  |
  6 |   25   100  |
  7 |   30    30  |
  8 |   50    50  |
    +-------------+
Subject: 
  141
         1     2
    +-------------+
  1 |  120     0  |
  2 |   10    90  |
  3 |  120     0  |
  4 |   20    80  |
  5 |  150     0  |
  6 |   25   100  |
  7 |   20    40  |
  8 |   30    70  |
    +-------------+
Subject: 
  142
         1     2
    +-------------+
  1 |  120     0  |
  2 |   20    60  |
  3 |  120     0  |
  4 |   30    60  |
  5 |  150     0  |
  6 |   35    80  |
  7 |   60     0  |
  8 |  100     0  |
    +-------------+

:         
:         
: end
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
r; t=0.01 10:50:27

. 
. 
end of do-file
r; t=0.08 10:50:27

. 
. set rmsg on
r; t=0.00 10:50:27

. 
. /// Running powerps with aei for 5 subjects; 10k & 50k simulations.
> timer clear 1
r; t=0.00 10:50:27

. 
. local timer_nr = 1
r; t=0.00 10:50:27

. 
. foreach simulations in 1000 10000 50000 {
  2.         
.         timer on `timer_nr'
  3.         
.         forvalues subject = 1/5 {
  4.                 
.                 di "Simulations: `simulations'; Subject: `subject'"
  5.                 
.                 powerps, price(P) quantity(Q`subject') sim(`simulations') aei axiom(all) progress
  6. 
.         }
  7.         
.         timer off `timer_nr'
  8.         
.         local timer_nr = `timer_nr' + 1 
  9.         
. }
Simulations: 1000; Subject: 1
Loop progress (1000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
...............................--Break--
r(1); t=519.16 10:59:06

end of do-file

--Break--
r(1); t=519.25 10:59:06

. aei, price(P) quantity(Q1)

------------------------------------
       Axiom |       AEI       Tol. 
-------------+----------------------
       eGARP |         1   1.00e-12 
------------------------------------
r; t=0.01 10:59:14

. aei, price(P) quantity(Q1) tol(12)

------------------------------------
       Axiom |       AEI       Tol. 
-------------+----------------------
       eGARP |         1   1.00e-12 
------------------------------------
r; t=0.01 10:59:32

. aei, price(P) quantity(Q1) tol(4)

------------------------------------
       Axiom |       AEI       Tol. 
-------------+----------------------
       eGARP |         1      .0001 
------------------------------------
r; t=0.00 10:59:35

. aei, price(P) quantity(Q1) tol(6)

------------------------------------
       Axiom |       AEI       Tol. 
-------------+----------------------
       eGARP |         1   1.00e-06 
------------------------------------
r; t=0.00 10:59:38

. return list

scalars:
          r(TOLERANCE) =  1.00000000000e-06
         r(EFFICIENCY) =  1

macros:
              r(AXIOM) : "eGARP"
r; t=0.00 10:59:46

. discard
r; t=0.01 11:00:26

. aei, price(P) quantity(Q1) tol(6)

------------------------------------
       Axiom |       AEI       Tol. 
-------------+----------------------
       eGARP |         1   1.00e-06 
------------------------------------
r; t=0.01 11:00:28

. return list

scalars:
          r(TOLERANCE) =  1.00000000000e-06
         r(EFFICIENCY) =  1

macros:
              r(AXIOM) : "eGARP"
r; t=0.01 11:00:30

. powerps, price(P) quantity(Q1) sim(10) aei

----------------------------------------------------------
      Axioms |     Power         PS        Sim        Eff 
-------------+--------------------------------------------
       eGARP |         1          1         10          1 
----------------------------------------------------------
 
Summary statistics for simulations:

-----------------------------------------------
       eGARP |   Num_Vio   Frac_Vio        AEI 
-------------+---------------------------------
        Mean |       7.7     13.752   .8100673 
   Std. Dev. |   5.45792   9.747019   .0947965 
         Min |         1       1.79   .5820829 
          Q1 |         3       5.36   .7845977 
      Median |       5.5       9.82   .8329844 
          Q3 |        15      26.79   .8805235 
         Max |        15      26.79   .9167151 
-----------------------------------------------

r; t=0.23 11:01:16

. powerps, price(P) quantity(Q1) sim(10) aei tol(4)

----------------------------------------------------------
      Axioms |     Power         PS        Sim        Eff 
-------------+--------------------------------------------
       eGARP |         1          1         10          1 
----------------------------------------------------------
 
Summary statistics for simulations:

-----------------------------------------------
       eGARP |   Num_Vio   Frac_Vio        AEI 
-------------+---------------------------------
        Mean |       7.7     13.752     .81008 
   Std. Dev. |   5.45792   9.747019   .0948024 
         Min |         1       1.79   .5820618 
          Q1 |         3       5.36   .7846069 
      Median |       5.5       9.82   .8330078 
          Q3 |        15      26.79   .8805542 
         Max |        15      26.79    .916687 
-----------------------------------------------

r; t=0.10 11:01:21

. powerps, price(P) quantity(Q1) sim(10) aei tol(12)

----------------------------------------------------------
      Axioms |     Power         PS        Sim        Eff 
-------------+--------------------------------------------
       eGARP |         1          1         10          1 
----------------------------------------------------------
 
Summary statistics for simulations:

-----------------------------------------------
       eGARP |   Num_Vio   Frac_Vio        AEI 
-------------+---------------------------------
        Mean |       7.7     13.752   .8100673 
   Std. Dev. |   5.45792   9.747019   .0947965 
         Min |         1       1.79   .5820829 
          Q1 |         3       5.36   .7845977 
      Median |       5.5       9.82   .8329844 
          Q3 |        15      26.79   .8805235 
         Max |        15      26.79   .9167151 
-----------------------------------------------

r; t=0.21 11:01:24

. return list

scalars:
        r(POWER_egarp) =  1
           r(PS_egarp) =  1
  r(SIMULATIONS_egarp) =  10
   r(EFFICIENCY_egarp) =  1

macros:
        r(AXIOM_egarp) : "eGARP"

matrices:
     r(SUMSTATS_egarp) :  7 x 3
   r(SIMRESULTS_egarp) :  10 x 3
r; t=0.00 11:01:31

. aei, price(P) quantity(Q1)

------------------------------------
       Axiom |       AEI       Tol. 
-------------+----------------------
       eGARP |         1   1.00e-12 
------------------------------------
r; t=0.00 11:01:46

. return list

scalars:
          r(TOLERANCE) =  1.00000000000e-12
         r(EFFICIENCY) =  1

macros:
              r(AXIOM) : "eGARP"
r; t=0.01 11:01:48

. adopath
  [1]  (BASE)      "C:\Program Files\Stata16\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata16\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\marcos.demetry\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:/Users/marcos.demetry/Dropbox/IFN/Per Hjertstrand/STATA//results_for_paper/code"
r; t=0.00 11:02:21

. discard
r; t=0.01 11:04:05

. aei, price(P) quantity(Q1)

------------------------------------
       Axiom |       AEI       Tol. 
-------------+----------------------
       eGARP |         1   1.00e-12 
------------------------------------
r; t=0.01 11:04:07

. return list

scalars:
          r(TOLERANCE) =  1.00000000000e-12
         r(EFFICIENCY) =  1

macros:
              r(AXIOM) : "eGARP"
r; t=0.01 11:04:09

. do "C:\Users\MARCOS~1.DEM\AppData\Local\Temp\STD2664_000000.tmp"

. clear all
r; t=0.01 11:04:28

. set more off
r; t=0.00 11:04:28

. capture log close
